1. Get all the properties that can be applied to instances of the Politician class (<http://dbpedia.org/ontology/Politician>)
Query:
select distinct ?property where{
?s rdf:type <http://dbpedia.org/ontology/Politician> .
?s ?property ?o
}

Result:
https://es.dbpedia.org/sparql?default-graph-uri=&query=select+distinct+%3Fproperty+where%7B%0D%0A%3Fs+rdf%3Atype+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A%3Fs+%3Fproperty+%3Fo%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+


2. Get all the properties, except rdf:type, that can be applied to instances of the Politician class
Query:
select distinct ?property where{
?s rdf:type <http://dbpedia.org/ontology/Politician> .
?s ?property ?o
FILTER (?property!=rdf:type)
}

Result: 
https://es.dbpedia.org/sparql?default-graph-uri=&query=select+distinct+%3Fproperty+where%7B%0D%0A%3Fs+rdf%3Atype+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A%3Fs+%3Fproperty+%3Fo%0D%0AFILTER+%28%3Fproperty%21%3Drdf%3Atype%29%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+


3.Which different values exist for the properties, except for rdf:type, applicable to the instances of Politician?
Query:
select distinct ?value where{
?s rdf:type <http://dbpedia.org/ontology/Politician> .
?s ?property ?value
FILTER (?property!=rdf:type)
}
Result: 
https://es.dbpedia.org/sparql?default-graph-uri=&query=select+distinct+%3Fvalue+where%7B%0D%0A%3Fs+rdf%3Atype+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A%3Fs+%3Fproperty+%3Fvalue%0D%0AFILTER+%28%3Fproperty%21%3Drdf%3Atype%29%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+


4.For each of these applicable properties, except for rdf:type, which different values do they take globally for all those instances?
Query:
select distinct ?property ?value where{
?s rdf:type <http://dbpedia.org/ontology/Politician> .
?s ?property ?value 
FILTER (?property!=rdf:type)
}

Result:
https://es.dbpedia.org/sparql?default-graph-uri=&query=select+distinct+%3Fproperty+%3Fvalue+where%7B%0D%0A%3Fs+rdf%3Atype+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A%3Fs+%3Fproperty+%3Fvalue+%0D%0AFILTER+%28%3Fproperty%21%3Drdf%3Atype%29%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+

5.For each of these applicable properties, except for rdf:type, how many distinct values do they take globally for all those instances?
Query:
select distinct ?property COUNT(distinct ?value) where{
?s rdf:type <http://dbpedia.org/ontology/Politician> .
?s ?property ?value
FILTER (?property!=rdf:type)
}

Result:
https://es.dbpedia.org/sparql?default-graph-uri=&query=select+distinct+%3Fproperty+COUNT%28distinct+%3Fvalue%29+where%7B%0D%0A%3Fs+rdf%3Atype+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E+.%0D%0A%3Fs+%3Fproperty+%3Fvalue%0D%0AFILTER+%28%3Fproperty%21%3Drdf%3Atype%29%0D%0A%7D%0D%0A&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+
