
1. Get all the properties that can be applied to instances of
the Politician class
(<http://dbpedia.org/ontology/Politician>)

SELECT distinct ?p WHERE {
?ins a <http://dbpedia.org/ontology/Politician>.
?ins ?p ?o.
}

Resultado 
https://es.dbpedia.org/sparql?default-graph-uri=&query=SELECT+distinct+%3Fp+WHERE+%7B%0D%0A%3Fins+a+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E.%0D%0A%3Fins+%3Fp+%3Fo.%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+

2. Get all the properties, except rdf:type, that can be applied
to instances of the Politician class

SELECT distinct ?p WHERE {
?ins a <http://dbpedia.org/ontology/Politician>.
?ins ?p ?o.
FILTER (?p!=rdf:type)
} 

resultado
https://es.dbpedia.org/sparql?default-graph-uri=&query=SELECT+distinct+%3Fp+WHERE+%7B%0D%0A%3Fins+a+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E.%0D%0A%3Fins+%3Fp+%3Fo.%0D%0AFILTER+%28%3Fp%21%3Drdf%3Atype%29%0D%0A%7D+&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+

3. Which different values exist for the properties, except
rdf:type, of the instances of the Politician class?
SELECT distinct ?o WHERE {
?ins a <http://dbpedia.org/ontology/Politician>.
?ins ?p ?o.
FILTER (?p!=rdf:type)
} 

4. For each of the properties, except rdf:type, that can be
applied to instances of the Politician class, which different
values do they take in those instances?

SELECT distinct ?p ?o WHERE {
?ins a <http://dbpedia.org/ontology/Politician>.
?ins ?p ?o.
FILTER (?p!=rdf:type)
} 

resultado
https://es.dbpedia.org/sparql?default-graph-uri=&query=SELECT+distinct+%3Fp+%3Fo+WHERE+%7B%0D%0A%3Fins+a+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E.%0D%0A%3Fins+%3Fp+%3Fo.%0D%0AFILTER+%28%3Fp%21%3Drdf%3Atype%29%0D%0A%7D+&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+

5. For each of the properties, except rdf:type, that can be
applied to instances of the Politician class, how many
distinct values do they take in those instances?

SELECT DISTINCT ?p COUNT(DISTINCT ?o) WHERE {
?ins a <http://dbpedia.org/ontology/Politician>.
?ins ?p ?o.
FILTER (?p!=rdf:type)
} 

resultado
https://es.dbpedia.org/sparql?default-graph-uri=&query=%0D%0ASELECT+DISTINCT+%3Fp+COUNT%28DISTINCT+%3Fo%29+WHERE+%7B%0D%0A%3Fins+a+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E.%0D%0A%3Fins+%3Fp+%3Fo.%0D%0AFILTER+%28%3Fp%21%3Drdf%3Atype%29%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+