1. Get all the properties that can be applied to instances of the Politician class (<http://dbpedia.org/ontology/Politician>)

PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?property WHERE {
 ?instance rdf:type dbo:Politician.
 ?instance ?property ?value.
}

Result:
https://es.dbpedia.org/sparql?default-graph-uri=&query=PREFIX+dbo%3A+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2F%3E%0D%0ASELECT+DISTINCT+%3Fproperty+WHERE+%7B%0D%0A+%3Finstance+rdf%3Atype+dbo%3APolitician.%0D%0A+%3Finstance+%3Fproperty+%3Fvalue.%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+

2. Get all the properties, except rdf:type, that can be applied to instances of the Politician class

PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?property WHERE {
 ?instance rdf:type dbo:Politician.
 ?instance ?property ?value.
 FILTER( ?property != rdf:type )
}

Result:
https://es.dbpedia.org/sparql?default-graph-uri=&query=PREFIX+dbo%3A+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2F%3E%0D%0ASELECT+DISTINCT+%3Fproperty+WHERE+%7B%0D%0A+%3Finstance+rdf%3Atype+dbo%3APolitician.%0D%0A+%3Finstance+%3Fproperty+%3Fvalue.%0D%0A+FILTER%28+%3Fproperty+%21%3D+rdf%3Atype+%29%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+

3. Which different values exist for the properties, except for rdf:type, applicable to the instances of Politician?

PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?value WHERE {
 ?instance rdf:type dbo:Politician.
 ?instance ?property ?value.
 FILTER( ?property != rdf:type )
}

Result:
https://es.dbpedia.org/sparql?default-graph-uri=&query=PREFIX+dbo%3A+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2F%3E%0D%0ASELECT+DISTINCT+%3Fvalue+WHERE+%7B%0D%0A+%3Finstance+rdf%3Atype+dbo%3APolitician.%0D%0A+%3Finstance+%3Fproperty+%3Fvalue.%0D%0A+FILTER%28+%3Fproperty+%21%3D+rdf%3Atype+%29%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+

4. For each of these applicable properties, except for rdf:type, which different values do they take globally for all those instances?

PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?property, ?value WHERE {
 ?instance rdf:type dbo:Politician.
 ?instance ?property ?value.
 FILTER( ?property != rdf:type )
}

Result:
https://es.dbpedia.org/sparql?default-graph-uri=&query=PREFIX+dbo%3A+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2F%3E%0D%0ASELECT+DISTINCT+%3Fproperty%2C+%3Fvalue+WHERE+%7B%0D%0A+%3Finstance+rdf%3Atype+dbo%3APolitician.%0D%0A+%3Finstance+%3Fproperty+%3Fvalue.%0D%0A+FILTER%28+%3Fproperty+%21%3D+rdf%3Atype+%29%0D%0A%7D%0D%0A&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+

5. For each of these applicable properties, except for rdf:type, how many distinct values do they take globally for all those instances?

PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?property (count(distinct ?value) as ?value) WHERE {
 ?instance rdf:type dbo:Politician.
 ?instance ?property ?value.
 FILTER( ?property != rdf:type )
}

Result:
https://es.dbpedia.org/sparql?default-graph-uri=&query=PREFIX+dbo%3A+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2F%3E%0D%0ASELECT+DISTINCT+%3Fproperty+%28count%28distinct+%3Fvalue%29+as+%3Fvalue%29+WHERE+%7B%0D%0A+%3Finstance+rdf%3Atype+dbo%3APolitician.%0D%0A+%3Finstance+%3Fproperty+%3Fvalue.%0D%0A+FILTER%28+%3Fproperty+%21%3D+rdf%3Atype+%29%0D%0A%7D&should-sponge=&format=text%2Fhtml&timeout=0&debug=on&run=+Run+Query+